PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_sha_v2.c
#if (CPUSS_CRYPTO_SHA256 == 1) && defined(CY_CRYPTO_CFG_SHA2_256_ENABLED)
    case CY_CRYPTO_MODE_SHA256:
        hashState->block          = (uint8_t*)((cy_stc_crypto_v2_sha256_buffers_t*)shaBuffers)->block;
        hashState->hash           = (uint8_t*)((cy_stc_crypto_v2_sha256_buffers_t*)shaBuffers)->hash;

        hashState->mode           = (uint32_t)mode;
        hashState->modeHw         = (uint32_t)CY_CRYPTO_V2_SHA2_256_OPC;
        hashState->initialHash    = (const uint8_t*)(sha256InitHash);
        hashState->blockSize      = CY_CRYPTO_SHA256_BLOCK_SIZE;
        hashState->hashSize       = CY_CRYPTO_SHA256_HASH_SIZE;
        hashState->digestSize     = CY_CRYPTO_SHA256_DIGEST_SIZE;
        break;
    case CY_CRYPTO_MODE_SHA224:
        hashState->block          = (uint8_t*)((cy_stc_crypto_v2_sha256_buffers_t*)shaBuffers)->block;
        hashState->hash           = (uint8_t*)((cy_stc_crypto_v2_sha256_buffers_t*)shaBuffers)->hash;

        hashState->mode           = (uint32_t)mode;
        hashState->modeHw         = (uint32_t)CY_CRYPTO_V2_SHA2_256_OPC;
        hashState->initialHash    = (const uint8_t*)(sha224InitHash);
        hashState->blockSize      = CY_CRYPTO_SHA256_BLOCK_SIZE;
        hashState->hashSize       = CY_CRYPTO_SHA256_HASH_SIZE;
        hashState->digestSize     = CY_CRYPTO_SHA224_DIGEST_SIZE;
        break;
#endif /* (CPUSS_CRYPTO_SHA256 == 1) && defined(CY_CRYPTO_CFG_SHA2_256_ENABLED) */

#if (CPUSS_CRYPTO_SHA512 == 1) && defined(CY_CRYPTO_CFG_SHA2_512_ENABLED)
    case CY_CRYPTO_MODE_SHA512:
        hashState->block          = (uint8_t*)((cy_stc_crypto_v2_sha512_buffers_t*)shaBuffers)->block;
        hashState->hash           = (uint8_t*)((cy_stc_crypto_v2_sha512_buffers_t*)shaBuffers)->hash;

        hashState->mode           = (uint32_t)mode;
        hashState->modeHw         = (uint32_t)CY_CRYPTO_V2_SHA2_512_OPC;
        hashState->initialHash    = (const uint8_t*)(sha512InitHash);
        hashState->blockSize      = CY_CRYPTO_SHA512_BLOCK_SIZE;
        hashState->hashSize       = CY_CRYPTO_SHA512_HASH_SIZE;
        hashState->digestSize     = CY_CRYPTO_SHA512_DIGEST_SIZE;
        break;
    case CY_CRYPTO_MODE_SHA384:
        hashState->block          = (uint8_t*)((cy_stc_crypto_v2_sha512_buffers_t*)shaBuffers)->block;
        hashState->hash           = (uint8_t*)((cy_stc_crypto_v2_sha512_buffers_t*)shaBuffers)->hash;

        hashState->mode           = (uint32_t)mode;
        hashState->modeHw         = (uint32_t)CY_CRYPTO_V2_SHA2_512_OPC;
        hashState->initialHash    = (const uint8_t*)(sha384InitHash);
        hashState->blockSize      = CY_CRYPTO_SHA512_BLOCK_SIZE;
        hashState->hashSize       = CY_CRYPTO_SHA512_HASH_SIZE;
        hashState->digestSize     = CY_CRYPTO_SHA384_DIGEST_SIZE;
        break;
    case CY_CRYPTO_MODE_SHA512_256:
        hashState->block          = (uint8_t*)((cy_stc_crypto_v2_sha512_buffers_t*)shaBuffers)->block;
        hashState->hash           = (uint8_t*)((cy_stc_crypto_v2_sha512_buffers_t*)shaBuffers)->hash;

        hashState->mode           = (uint32_t)mode;
        hashState->modeHw         = (uint32_t)CY_CRYPTO_V2_SHA2_512_OPC;
        hashState->initialHash    = (const uint8_t*)(sha512_256InitHash);
        hashState->blockSize      = CY_CRYPTO_SHA512_BLOCK_SIZE;
        hashState->hashSize       = CY_CRYPTO_SHA512_HASH_SIZE;
        hashState->digestSize     = CY_CRYPTO_SHA512_256_DIGEST_SIZE;
        break;
    case CY_CRYPTO_MODE_SHA512_224:
        hashState->block          = (uint8_t*)((cy_stc_crypto_v2_sha512_buffers_t*)shaBuffers)->block;
        hashState->hash           = (uint8_t*)((cy_stc_crypto_v2_sha512_buffers_t*)shaBuffers)->hash;

        hashState->mode           = (uint32_t)mode;
        hashState->modeHw         = (uint32_t)CY_CRYPTO_V2_SHA2_512_OPC;
        hashState->initialHash    = (const uint8_t*)(sha512_224InitHash);
        hashState->blockSize      = CY_CRYPTO_SHA512_BLOCK_SIZE;
        hashState->hashSize       = CY_CRYPTO_SHA512_HASH_SIZE;
        hashState->digestSize     = CY_CRYPTO_SHA512_224_DIGEST_SIZE;
        break;
#endif /* (CPUSS_CRYPTO_SHA512 == 1) && defined(CY_CRYPTO_CFG_SHA2_512_ENABLED) */

#if (CPUSS_CRYPTO_SHA3 == 1) && defined(CY_CRYPTO_CFG_SHA3_ENABLED)
    case CY_CRYPTO_MODE_SHA3_224:
        hashState->hash           = (uint8_t*)((cy_stc_crypto_v2_sha3_buffers_t*)shaBuffers)->hash;
        hashState->mode           = (uint32_t)mode;
        hashState->modeHw         = (uint32_t)CY_CRYPTO_V2_SHA3_OPC;
        hashState->blockSize      = CY_CRYPTO_SHA3_224_BLOCK_SIZE;
        hashState->digestSize     = CY_CRYPTO_SHA224_DIGEST_SIZE;
        hashState->hashSize       = 0u;
        break;
    case CY_CRYPTO_MODE_SHA3_256:
        hashState->hash           = (uint8_t*)((cy_stc_crypto_v2_sha3_buffers_t*)shaBuffers)->hash;
        hashState->mode           = (uint32_t)mode;
        hashState->modeHw         = (uint32_t)CY_CRYPTO_V2_SHA3_OPC;
        hashState->blockSize      = CY_CRYPTO_SHA3_256_BLOCK_SIZE;
        hashState->digestSize     = CY_CRYPTO_SHA256_DIGEST_SIZE;
        hashState->hashSize       = 0u;
        break;
    case CY_CRYPTO_MODE_SHA3_384:
        hashState->hash           = (uint8_t*)((cy_stc_crypto_v2_sha3_buffers_t*)shaBuffers)->hash;
        hashState->mode           = (uint32_t)mode;
        hashState->modeHw         = (uint32_t)CY_CRYPTO_V2_SHA3_OPC;
        hashState->blockSize      = CY_CRYPTO_SHA3_384_BLOCK_SIZE;
        hashState->digestSize     = CY_CRYPTO_SHA384_DIGEST_SIZE;
        hashState->hashSize       = 0u;
        break;
    case CY_CRYPTO_MODE_SHA3_512:
        hashState->hash           = (uint8_t*)((cy_stc_crypto_v2_sha3_buffers_t*)shaBuffers)->hash;
        hashState->mode           = (uint32_t)mode;
        hashState->modeHw         = (uint32_t)CY_CRYPTO_V2_SHA3_OPC;
        hashState->blockSize      = CY_CRYPTO_SHA3_512_BLOCK_SIZE;
        hashState->digestSize     = CY_CRYPTO_SHA512_DIGEST_SIZE;
        hashState->hashSize       = 0u;
        break;
#endif/* (CPUSS_CRYPTO_SHA3 == 1) && defined(CY_CRYPTO_CFG_SHA3_ENABLED) */
    default:
        tmpResult = CY_CRYPTO_BAD_PARAMS;
        break;
    }

    return (tmpResult);
}


