PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_sha_v2.c
    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Sha3_Finish
****************************************************************************//**
*
* Completes SHA3 calculation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \param digest
* The pointer to the calculated hash digest.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Sha3_Finish(CRYPTO_Type *base,
        cy_stc_crypto_sha_state_t *hashState,
        uint8_t *digest)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t *hashRemap;

    if ((hashState != NULL) && (digest != NULL))
    {
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to int32_t.');
        SCB_InvalidateDCache_by_Addr((volatile void *)hashState->hash, (int32_t)(CY_CRYPTO_SHA_MAX_HASH_SIZE));
#endif

        uint32_t hashBlockSize   = hashState->blockSize;
        uint32_t hashBlockIdx    = hashState->blockIdx;
        hashRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hashState->hash);

        hashState->hash[hashBlockIdx] = hashState->hash[hashBlockIdx] ^ 0x06U;
        hashState->hash[hashBlockSize - 1U] = hashState->hash[hashBlockSize - 1U] ^ 0x80U;

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to int32_t.');
        SCB_CleanDCache_by_Addr((volatile void *)hashState->hash, (int32_t)(CY_CRYPTO_SHA_MAX_HASH_SIZE));
#endif
        /* Load the calculated hash state from the context buffer */
        Cy_Crypto_Core_V2_RBClear(base);
        Cy_Crypto_Core_V2_Sync(base);

        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, hashRemap, CY_CRYPTO_SHA3_STATE_SIZE);
        Cy_Crypto_Core_V2_RBXor(base, 0U, 128U);
        Cy_Crypto_Core_V2_RBSwap(base);

        Cy_Crypto_Core_V2_RBXor(base, 0U, 72U);
        Cy_Crypto_Core_V2_RBSwap(base);
        Cy_Crypto_Core_V2_Sync(base);

        Cy_Crypto_Core_V2_Run(base, hashState->modeHw);
        Cy_Crypto_Core_V2_Sync(base);

        /* Write digest. */
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, digest, hashState->digestSize);
        Cy_Crypto_Core_V2_RBStore(base, 0U, hashState->digestSize);
        Cy_Crypto_Core_V2_FFStoreSync(base);

        tmpResult = CY_CRYPTO_SUCCESS;

    }

    return (tmpResult);
}
#endif

/*******************************************************************************
* Function Name: Cy_Crypto_Sha1_Sha2_Update
****************************************************************************//**
*
* Performs the SHA1/SHA2 update calculation on message.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \param message
* The pointer to the message whose Hash is being computed.
*
* \param messageSize
* The size of the message whose Hash is being computed.
*
* \return
* \ref cy_en_crypto_status_t
*
*
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Sha1_Sha2_Update(CRYPTO_Type *base, cy_stc_crypto_sha_state_t *hashState,
        uint8_t const *message,
        uint32_t messageSize)
{

    hashState->messageSize += messageSize;
    uint8_t *hashRemap;
    uint8_t *blockRemap;
    uint8_t *messageRemap;

    hashRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hashState->hash);
    blockRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hashState->block);
    messageRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(message);

    uint32_t hashBlockIdx  = hashState->blockIdx;
    uint32_t hashBlockSize = hashState->blockSize;

    /* Load the calculated hash from the context buffer */
    Cy_Crypto_Core_V2_RBClear(base);
    Cy_Crypto_Core_V2_Sync(base);

    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, hashRemap, hashState->hashSize);
    Cy_Crypto_Core_V2_RBXor(base, 0U, hashState->hashSize);
    Cy_Crypto_Core_V2_Sync(base);
    Cy_Crypto_Core_V2_RBSwap(base);

    /* Load the remaining block from the context buffer */
    if (hashBlockIdx != 0U)
    {
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, blockRemap, hashBlockIdx);
        Cy_Crypto_Core_V2_RBXor(base, 0U, hashBlockIdx);
        Cy_Crypto_Core_V2_Sync(base);
    }

    /* Start the hash calculating */
    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, messageRemap, messageSize);

    /* Processing the fully filled blocks with remaining buffer data */
    while ((hashBlockIdx + messageSize) >= hashBlockSize)
    {
        uint32_t tempBlockSize = hashBlockSize - hashBlockIdx;

        Cy_Crypto_Core_V2_RBXor(base, hashBlockIdx, tempBlockSize);

        Cy_Crypto_Core_V2_Run(base, hashState->modeHw);

        messageSize -= tempBlockSize;

        hashBlockIdx = 0U;
    }

    /* The remaining block will be calculated in the Finish function */
    hashState->blockIdx = hashBlockIdx + messageSize;

    /* Load the end of the message (tail that less then block size) to the register buffer */
    if (messageSize != 0U)
    {
        Cy_Crypto_Core_V2_RBXor(base, hashBlockIdx, messageSize);
        Cy_Crypto_Core_V2_Sync(base);
    }

    /* Save the remaining data to the context buffer */
    if (hashState->blockIdx != 0U)
    {
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, blockRemap, hashState->blockIdx);
        Cy_Crypto_Core_V2_RBStore(base, 0U, hashState->blockIdx);
        Cy_Crypto_Core_V2_Sync(base);
    }

    /* Store the calculated hash to the context buffer */
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, hashRemap, hashState->hashSize);
    Cy_Crypto_Core_V2_RBSwap(base);
    Cy_Crypto_Core_V2_RBStore(base, 0U, hashState->hashSize);
    Cy_Crypto_Core_V2_Sync(base);
    Cy_Crypto_Core_V2_RBSwap(base);

