PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_sha_v2.c
/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Sha
****************************************************************************//**
*
* Performs the SHA Hash function.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param mode
* \ref cy_en_crypto_sha_mode_t
*
* \param message
* The pointer to a message whose hash value is being computed.
*
* \param messageSize
* The size of a message.
*
* \param digest
* The pointer to the hash digest.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Sha(CRYPTO_Type *base,
        uint8_t const *message,
        uint32_t messageSize,
        uint8_t *digest,
        cy_en_crypto_sha_mode_t mode)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    /* Allocate maximal space for the structure which stores the SHA buffers */
    uint8_t shaBuffers_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_v2_sha_buffers_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
    /* Allocate space for the structure which stores the SHA context */
    uint8_t hashState_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_sha_state_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];

    cy_stc_crypto_v2_sha_buffers_t *shaBuffers = (cy_stc_crypto_v2_sha_buffers_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(shaBuffers_t);
    cy_stc_crypto_sha_state_t *hashState = (cy_stc_crypto_sha_state_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(hashState_t);

    Cy_Crypto_Core_V2_MemSet(base, (void*)shaBuffers, 0x00U, (uint16_t)sizeof(cy_stc_crypto_v2_sha_buffers_t));
    Cy_Crypto_Core_V2_MemSet(base, (void*)hashState, 0x00U, (uint16_t)sizeof(cy_stc_crypto_sha_state_t));

    /* No buffers are needed for the Crypto_ver2 IP block. */
    tmpResult = Cy_Crypto_Core_V2_Sha_Init(base, hashState, mode, shaBuffers);

    if (CY_CRYPTO_SUCCESS == tmpResult)
    {
        tmpResult = Cy_Crypto_Core_V2_Sha_Start(base, hashState);
    }
    if (CY_CRYPTO_SUCCESS == tmpResult)
    {
        tmpResult = Cy_Crypto_Core_V2_Sha_Update(base, hashState, message, messageSize);
    }

    if (CY_CRYPTO_SUCCESS == tmpResult)
    {
        tmpResult = Cy_Crypto_Core_V2_Sha_Finish(base, hashState, digest);
    }

    if (CY_CRYPTO_SUCCESS == tmpResult)
    {
        tmpResult = Cy_Crypto_Core_V2_Sha_Free(base, hashState);
    }

    return (tmpResult);
}


#endif /* (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_SHA_C) */

#if defined(__cplusplus)
}
#endif

#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */

#endif /* defined(CY_IP_MXCRYPTO) */


/* [] END OF FILE */
